[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:32:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && ( // if initial contents is true and...
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled // we can't edit the ID field
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: ArticlesForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:32:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && ( // if initial contents is true and...
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled // we can't edit the ID field
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: ArticlesForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:53:33
           id="title"
           type="text"
           isInvalid={Boolean(errors.title)}
-          {...register("title", {
-            required: "Title is required",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("title", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:54:23
           type="text"
           isInvalid={Boolean(errors.title)}
           {...register("title", {
-            required: "Title is required",
+            required: "",
             maxLength: {
               value: 255,
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:88:23
           type="text"
           isInvalid={Boolean(errors.explanation)}
           {...register("explanation", {
-            required: "Explanation is required",
+            required: "",
           })}
         />
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:123:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded && "Date Added is required"}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Added is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.jsx:123:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded && "Date Added is required"}
+          {errors.dateAdded || "Date Added is required"}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
