[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:64:32
           id="name"
           type="text"
           isInvalid={Boolean(errors.name)}
-          {...register("name", {
-            required: "Item name is required.",
-            maxLength: {
-              value: 50,
-              message: "Max length 50 characters",
-            },
-          })}
+          {...register("name", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Item name is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:66:24
           isInvalid={Boolean(errors.name)}
           {...register("name", {
             required: "Item name is required.",
-            maxLength: {
-              value: 50,
-              message: "Max length 50 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 50 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:84:35
           id="station"
           type="text"
           isInvalid={Boolean(errors.station)}
-          {...register("station", {
-            required: "Station is required.",
-            maxLength: {
-              value: 40,
-              message: "Max length 40 characters",
-            },
-          })}
+          {...register("station", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Station is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:86:24
           isInvalid={Boolean(errors.station)}
           {...register("station", {
             required: "Station is required.",
-            maxLength: {
-              value: 40,
-              message: "Max length 40 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 40 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:88:24
             required: "Station is required.",
             maxLength: {
               value: 40,
-              message: "Max length 40 characters",
+              message: "",
             },
           })}
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 40 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
