[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:47:5
       header: "Dining Commons Code",
       accessorKey: "diningCommonsCode",
     },
-    {
-      header: "Item Name",
-      accessorKey: "name",
-    },
+    {},
     {
       header: "Station",
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:48:15
       accessorKey: "diningCommonsCode",
     },
     {
-      header: "Item Name",
+      header: "",
       accessorKey: "name",
     },
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Item Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemTable"
