[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsbdiningcommonsmenuitem?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsbdiningcommonsmenuitem`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:34:11
     params: {
       id: ucsbDiningCommonsMenuItem.id,
     },
-    data: {
-      diningCommonsCode: ucsbDiningCommonsMenuItem.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItem.name,
-      station: ucsbDiningCommonsMenuItem.station,
-    },
+    data: {},
   });
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"diningCommonsCode":"DLG","name":"Pe…' // Object.is equality

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:58:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsbdiningcommonsmenuitem" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
