[Killed] BlockStatement
main/components/Articles/ArticlesTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/articles/edit/${cell.row.original.id}`);
-  }; // this is what happens when you click the edit button
+  const editCallback = (cell) => {}; // this is what happens when you click the edit button
 
   // Stryker disable all : hard to test for query caching
killedBy: ArticlesTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/articles/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:48:15
       accessorKey: "title",
     },
     {
-      header: "URL",
+      header: "",
       accessorKey: "url",
     },
killedBy: ArticlesTable tests renders empty table correctly
statusReason: Unable to find an element with the text: URL. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"
