[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:20:34
     },
   });
 
-  const onSuccess = (article) => {
-    toast(
-      `New article Created - id: ${article.id} title: ${article.title} explanation: ${article.explanation} email: ${article.email} dateAdded: ${article.dateAdded}`,
-    );
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
