[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.jsx:43:34
     },
   });
 
-  const onSuccess = (article) => {
-    toast(
-      `Article Updated - id: ${article.id} title: ${article.title} url: ${article.url} explanation: ${article.explanation} email: ${article.email} dateAdded: ${article.dateAdded}`,
-    );
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
