[Killed] BlockStatement
src/main/utils/articlesUtils.js:3:42
 import { toast } from "react-toastify";
 
-export function onDeleteSuccess(message) {
-  console.log(message);
-  toast(message);
-} // when something is deleted this puts up a box confirming it was deleted for testing purposes
+export function onDeleteSuccess(message) {} // when something is deleted this puts up a box confirming it was deleted for testing purposes
 
 export function cellToAxiosParamsDelete(cell) {
killedBy: articlesUtils onDeleteSuccess It puts the message on console.log and in a toast
statusReason: expected "spy" to be called with arguments: [ 'abc' ]

Number of calls: 0

[Killed] BlockStatement
src/main/utils/articlesUtils.js:8:47
   toast(message);
 } // when something is deleted this puts up a box confirming it was deleted for testing purposes
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/articles",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-} // axios lets out frontend talk to the backend, so we dont have to use swagger
+export function cellToAxiosParamsDelete(cell) {} // axios lets out frontend talk to the backend, so we dont have to use swagger
 
killedBy: ArticlesTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table
